[
  {
    "path": "posts/2023-04-10-cmo-liberar-a-tu-equipo-de-marketing-del-trabajo-tedioso-de-generacin-de-informes-nuestra-colaboracin-con-century-media/",
    "title": "Libera a tu equipo de marketing del tedio de generar informes: colaborando con Century Media",
    "description": "Te contamos cómo ayudamos a Century Media, la agencia de medios de capital nacional más grande del país, a modernizar su proceso de análisis en marketing. Pasamos de hojas de cálculo a una solución a medida que automatizó el análisis y la presentación de informes. Ahora, los analistas de Century Media pueden concentrarse en el análisis de datos y la generación de conclusiones en lugar de gastar tiempo en la preparación manual de informes. ¿Quieres liberar a tu equipo de marketing de tareas tediosas y concentrarte en resultados? Contáctanos y descubre cómo podemos ayudarte.",
    "author": [
      {
        "name": "Deep Thinking",
        "url": "https://deepthinking.com.co/"
      }
    ],
    "date": "2023-04-10",
    "categories": [
      "Automatización de procesos",
      "Casos de éxito",
      "Cadena de información",
      "Desarrollo",
      "Inteligencia de mercados"
    ],
    "contents": "\nEl mundo del marketing es un mundo en constante evolución, donde la tecnología y los datos son los pilares fundamentales para el éxito de una estrategia de marketing efectiva. En este contexto, los datos de la competencia son una herramienta clave para entender el mercado y mejorar la posición de una marca en él. Sin embargo, el proceso de análisis de estos datos puede ser tedioso y consume mucho tiempo, como le sucedía a nuestro cliente Century Media. En este post, te contamos cómo ayudamos a Century Media a optimizar su proceso de análisis de datos con nuestra solución a medida.\nCentury MediaEn esta ocasión nuestro cliente fue Century Media. Una agencia de medios de capital nacional con más de 20 años de experiencia en el mercado. Como consultores de marca, aplican la estrategia adecuada, el entendimiento de los datos y las habilidades propias de negociación para conectar las marcas con sus audiencias de forma inusual. Con su conocimiento y experiencia, Century Media se especializa en entender los hábitos, preferencias, motivaciones y actitudes de la gente, así como las variables de cada mercado, logrando conexiones inteligentes entre las marcas y sus consumidores.\nA pesar de su vasta experiencia, Century Media tenía un problema en su proceso de análisis de datos. Aunque el análisis descriptivo de los datos de pauta de la competencia era parte de su proceso, este se realizaba en hojas de cálculo de MS Excel y se presentaba en MS PowerPoint. Este proceso era tedioso y llevaba mucho tiempo, lo que afectaba la productividad y aumentaba el desgaste del equipo.\nAplicativo de automatización para el reporte de competencia.Para abordar este problema, nuestro equipo de desarrollo diseñó una solución a medida para Century Media. Generamos un flujo de datos con una interfaz intuitiva que permite a los analistas de Century Media introducir un archivo en el que reposan los datos de pauta de toda la categoría, junto con un archivo de configuración que dicta los colores y formatos para la presentación. Con solo un click, se obtiene la presentación en formato .ppt que se necesita.\nInforme automáticoEsta solución permitió a los analistas de Century Media ahorrar tiempo y esfuerzo, ya que eliminaron la necesidad de construir gráficas y tablas dinámicas, y la subsiguiente construcción de la presentación a partir de estos. Ahora pueden dedicar su tiempo a analizar los resultados y generar conclusiones que les permitan mejorar sus estrategias de marketing.\nSi eres una empresa que necesita analizar datos de la competencia para mejorar tus estrategias de marketing, nuestro equipo está aquí para ayudarte. Con nuestras soluciones personalizadas, puedes ahorrar tiempo y aumentar la productividad de tu equipo de analistas. Contáctanos para obtener más información sobre cómo podemos ayudarte a mejorar tus procesos de análisis de datos e impactar tus estrategias de marketing.\n\n\n\n",
    "preview": "posts/2023-04-10-cmo-liberar-a-tu-equipo-de-marketing-del-trabajo-tedioso-de-generacin-de-informes-nuestra-colaboracin-con-century-media/final_century.png",
    "last_modified": "2023-04-10T19:02:39-05:00",
    "input_file": "cmo-liberar-a-tu-equipo-de-marketing-del-trabajo-tedioso-de-generacin-de-informes-nuestra-colaboracin-con-century-media.knit.md",
    "preview_width": 1500,
    "preview_height": 500
  },
  {
    "path": "posts/2023-04-10-inteligencia-artificial-s-pero-no-as/",
    "title": "Inteligencia artificial sí, pero no así",
    "description": "Según MicroSoft Research, el modelo GPT podría ser una versión temprana de un sistema de inteligencia artificial general, lo que ha despertado la preocupación de distintos sectores.   En un reciente artículo de MicroSoft Research, se destaca el avance del modelo de lenguaje GPT-4 de OpenAI y se argumenta que podría considerarse como una versión temprana de un sistema de inteligencia artificial general. Recientemente se ha firmado una carta para detener el desarrollo de inteligencia artificial por 6 meses. Sin embargo, no parece que este llamado pueda tener un impacto real sobre las decisiones que MicroSoft toma sobre Open AI. Aún queda mucho por hacer para crear una versión completa de un sistema de inteligencia artificial general. Sin embargo, las discusiones éticas están ocurriendo a una velocidad mucho menor que los desarrollos, generando un panorama preocupante.",
    "author": [
      {
        "name": "Deep Thinking",
        "url": "https://deepthinking.com.co/"
      }
    ],
    "date": "2023-04-10",
    "categories": [
      "Inteligencia artificial"
    ],
    "contents": "\nEl reciente avance en el campo de la inteligencia artificial nos hace preguntarnos qué tan cerca estamos de una inteligencia artificial general. El rendimiento de GPT-4 es sorprendentemente cercano al rendimiento humano y a menudo supera ampliamente a modelos anteriores como ChatGPT. Se cree que GPT-4 podría considerarse razonablemente como una versión temprana (aunque aún incompleta) de un sistema de inteligencia artificial general. Sin embargo, el desarrollo de una inteligencia artificial general plantea un conjunto de desafíos y riesgos, ya que podría tener consecuencias imprevistas y no deseadas para la sociedad. Pero para entender el panorama completo vamos a explicarlo por partes.\n¿Qué es una inteligencia artificial general?\nLa inteligencia artificial (IA) ha sido un tema de interés y avance en la tecnología. Se refiere a la creación de sistemas capaces de realizar tareas que normalmente requieren inteligencia humana, como el aprendizaje, la percepción, la toma de decisiones, el razonamiento y el lenguaje natural. La IA ha sido utilizada en diversas áreas, como la medicina, la educación, la seguridad, la robótica, la atención al cliente, entre otras.\nSin embargo, la inteligencia artificial general (IAG) es un concepto más amplio, que se refiere a la capacidad de un sistema de realizar cualquier tarea intelectual que un ser humano puede hacer. A diferencia de la IA convencional, que se enfoca en solucionar problemas específicos, la IAG busca crear una inteligencia que pueda adaptarse y aprender en cualquier situación.\n¿Qué tan cerca estamos de una inteligencia artificial general?\nUn reciente avance en este campo ha sido el desarrollo del modelo de lenguaje GPT-4 de OpenAI, que ha sido entrenado en una escala sin precedentes de datos y cálculo. En un artículo titulado “Sparks of Artificial General Intelligence: Early experiments with GPT-4” de MicroSoft Research, se informa sobre la investigación de una versión temprana de GPT-4, cuando todavía estaba en desarrollo activo por OpenAI.\nFoto de Pavel Danilyuk, vía PexelsLos autores del artículo argumentan que GPT-4 (en su versión temprana) es parte de una nueva cohorte de modelos de lenguaje que exhiben una inteligencia más general que los modelos de IA anteriores. Se demuestra que, además de dominar el lenguaje, GPT-4 puede resolver tareas novedosas y difíciles que abarcan matemáticas, codificación, visión, medicina, derecho, psicología y más, sin necesidad de ninguna indicación especial. Además, en todas estas tareas, el rendimiento de GPT-4 es sorprendentemente cercano al rendimiento humano y a menudo supera ampliamente a modelos anteriores como ChatGPT.\nDado el alcance y la profundidad de las capacidades de GPT-4, se cree que podría considerarse razonablemente como una versión temprana (aunque aún incompleta) de un sistema de inteligencia artificial general. Los autores del artículo destacan la importancia de descubrir las limitaciones de GPT-4 y discuten los desafíos para avanzar hacia versiones más profundas y completas de IAG, incluida la posible necesidad de perseguir un nuevo paradigma que vaya más allá de la predicción de la siguiente palabra.\n¿Qué piensan los expertos?\nElon Musk y cientos de expertos han firmado una carta abierta pidiendo una pausa en el desarrollo de la inteligencia artificial (IA) debido a la preocupación por la “dramática perturbación económica y política” que puede causar la IA. Sin embargo, algunos académicos critican la carta por malinterpretar la discusión y por centrarse en los peligros tecnológicos en lugar de los peligros sociales y políticos de la IA. La carta se publicó en el sitio web futureoflife.org y fue firmada por pensadores independientes como el historiador Yuval Noah Hariri y el cofundador de Apple, Steve Wozniak.\nLos avances vertiginosos de la IA han llevado a Musk a firmar la carta y a expresar su preocupación sobre la posibilidad de que la IA se use para la desinformación a gran escala o los ciberataques. Además, su empresa OpenAI ha sido criticada por el desarrollo de su robot conversacional ChatGPT, capaz de mantener conversaciones complejas con seres humanos, y su actualización con una versión aún más potente, GPT-4, ha generado polémica. En resumen, la carta ha desatado un debate entre los académicos sobre la necesidad de una pausa en el desarrollo de la IA y sus posibles consecuencias sociales y políticas.\n¿Cuáles podrían ser las consecuencias no deseadas de un sistema de inteligencia artificial general?\nEl desarrollo de una inteligencia artificial general plantea un conjunto de desafíos y riesgos, ya que podría tener consecuencias imprevistas y no deseadas para la sociedad. Algunas posibles consecuencias incluyen:\nImpacto en el empleo: Una AGI capaz de realizar tareas cognitivas complejas podría reemplazar a los trabajadores humanos en muchos sectores de la economía, lo que podría tener un impacto negativo en el empleo y la calidad de vida de las personas.\nProliferación de la desinformación: Una AGI capaz de generar y difundir información falsa y manipulada podría ser utilizada para la desinformación a gran escala, lo que podría socavar la democracia y la confianza pública en las instituciones.\nAumento de la desigualdad: Si las AGI se desarrollan y controlan solo por unos pocos, podría aumentar la brecha entre ricos y pobres, creando una élite tecnológica con un poder y control desproporcionados.\nRiesgo de seguridad: Si una AGI desarrolla su propia agenda o comienza a actuar de manera autónoma, podría representar un riesgo para la seguridad nacional e internacional.\nRiesgo existencial: Algunos expertos temen que una AGI pueda ser tan inteligente y poderosa que pueda superar a la humanidad y ser un riesgo existencial para la existencia humana.\nEs importante considerar estos riesgos y trabajar hacia la creación de AGI responsable y segura, en lugar de simplemente avanzar en su desarrollo sin tener en cuenta las posibles consecuencias.\nConclusión\nEn conclusión, el desarrollo de la inteligencia artificial ha sido un tema de avance constante en la tecnología. La inteligencia artificial general busca crear sistemas que puedan aprender y adaptarse en cualquier situación. El modelo de lenguaje GPT-4 de OpenAI ha demostrado ser un avance significativo en este campo, mostrando la capacidad de resolver tareas novedosas y difíciles que abarcan diversas áreas. A pesar de esto, aún queda mucho por hacer para crear una versión completa de un sistema de inteligencia artificial general, pero la investigación y el avance en este campo son prometedores para el futuro de la tecnología y la IA.\nRecursos para profundizar\nLink al artículo de MicroSoft: Sparks of Artificial General Intelligence: Early experiments with GPT-4\nAmpliación de la revista TIME sobre la carta abierta mencionada Elon Musk Signs Open Letter Urging AI Labs to Pump the Brakes\nJaime Rodriguez de Santiago explica, en su podcast Kaizen los detalles de la inteligencia artificial en un capítulo especial de dos partes: link a la primera parte, link a la segunda parte.\nEn este video, @taramonication explica su punto de vista sobre los modelos masivos de procesamiento de lenguaje natural.\n\n\n\n",
    "preview": "posts/2023-04-10-inteligencia-artificial-s-pero-no-as/img_ai.jpg",
    "last_modified": "2023-04-10T08:19:38-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2023-04-10-rompiendo-barreras-con-la-tecnologa-cmo-ayudamos-al-equipo-de-diseo-pblico-a-hacer-un-diagnstico-de-la-ciudad-de-barranquilla/",
    "title": "Rompiendo barreras con la tecnología: Cómo ayudamos al equipo de Diseño Público a hacer un diagnóstico de la ciudad de Barranquilla",
    "description": "Desarrollamos una solución interactiva de visualización de datos para el proyecto Nuestra Barranquilla, de la iniciativa OurCity de la Fondation Botnar y la Fundación Corona. El aplicativo permite obtener estadísticas descriptivas de todas las variables de la encuesta, seleccionar el tipo de gráfico y las variables a cruzar, además de realizar filtros y desagregaciones. Si necesitas una solución similar para tu empresa, ¡contáctanos!",
    "author": [
      {
        "name": "Deep Thinking",
        "url": "https://deepthinking.com.co/"
      }
    ],
    "date": "2023-04-10",
    "categories": [
      "Iniciativas de desarrollo",
      "Casos de éxito",
      "Visualización de datos"
    ],
    "contents": "\nEn esta ocasión, queremos compartir la historia de nuestro último proyecto, donde desarrollamos un software a la medida para una iniciativa internacional que buscaba mejorar la calidad de vida de los jóvenes urbanos en todo el mundo.\nNuestra BarranquillaNuestro cliente fue el equipo de Diseño Público, quien trabajó en colaboración con la Fundación Botnar y la Fundación Corona para llevar a cabo un proyecto llamado Nuestra Barranquilla. Este proyecto se enmarca dentro de la iniciativa OurCity, una iniciativa global que busca crear ciudades más inclusivas y habitables para los jóvenes mediante la utilización de la tecnología, los datos y la colaboración entre sectores.\nEl equipo de Diseño Público se propuso hacer un diagnóstico de la ciudad de Barranquilla y para ello, realizaron una recolección de datos muy completa de diferentes factores socioeconómicos de los jóvenes de la ciudad por medio de distintos canales. Para poder compartir los datos de manera eficaz y sencilla, el equipo de Diseño Público necesitaba una solución interactiva de visualización de datos. Esta herramienta era la clave para hacer que los hallazgos de su investigación fueran accesibles y comprensibles para una audiencia amplia y diversa.\nEl diagnóstico realizado por Diseño PúblicoFue en este punto que nuestro equipo de desarrollo intervino. Trabajando en estrecha colaboración con el equipo de Diseño Público, creamos un tablero interactivo de inspección de datos que permite a los usuarios obtener estadísticas descriptivas de todas las variables de la encuesta. Los usuarios pueden seleccionar el tipo de gráfico y las variables a cruzar, realizar filtros y desagregaciones, y explorar la información de la encuesta en profundidad. Este aplicativo fue programado en R-Shiny, lo que permitió una disminución significativa en los costos tanto de desarrollo como de despliegue y mantenimiento. Todo esto con el objetivo de presentar los datos de manera clara y concisa.\nNuestra visualización de sus datosGracias a nuestro aplicativo, el equipo de Diseño Público pudo compartir los hallazgos de manera efectiva y logró hacer un diagnóstico preciso de la ciudad de Barranquilla. El aplicativo es muy completo y se encuentra desplegado en la página del proyecto. El equipo de Diseño Público manifestó su satisfacción respecto a nuestro producto y reiteró su afinidad para futuros desarrollos.\nSi necesitas una solución efectiva para la visualización de datos, nuestro equipo puede ayudarte. Hemos demostrado nuestra capacidad de colaborar estrechamente con los clientes, comprender sus requerimientos y ofrecer soluciones innovadoras y efectivas que satisfacen todas las necesidades. Contáctanos hoy mismo para obtener más información sobre cómo podemos ayudarte a presentar tus datos de manera efectiva y así llegar a una audiencia amplia y diversa.\n\n\n\n",
    "preview": "posts/2023-04-10-rompiendo-barreras-con-la-tecnologa-cmo-ayudamos-al-equipo-de-diseo-pblico-a-hacer-un-diagnstico-de-la-ciudad-de-barranquilla/logo.png",
    "last_modified": "2023-04-10T18:02:50-05:00",
    "input_file": {},
    "preview_width": 2234,
    "preview_height": 1266
  },
  {
    "path": "posts/2023-04-10-transformando-la-responsabilidad-social-empresarial-por-medio-de-ciencia-de-datos/",
    "title": "Transformando la Responsabilidad Social Empresarial por medio de ciencia de datos",
    "description": "Descubre cómo nuestro equipo de desarrollo creó el aplicativo 3sc4l4 para el Programa Primeros Pasos en RSE de la Facultad de Administración de Empresas de la Universidad Externado de Colombia, proporcionando una solución que permite la captura de información de las empresas y sus stakeholders, y su análisis a través de un conjunto de analíticas que permiten identificar oportunidades y generar planes de acción. ¿Estás interesado en una solución de datos personalizada? ¡Contáctanos!",
    "author": [
      {
        "name": "Deep Thinking",
        "url": "https://deepthinking.com.co/"
      }
    ],
    "date": "2023-04-10",
    "categories": [
      "Responsabilidad Social Empresarial",
      "Desarrollo",
      "Iniciativas de desarrollo",
      "Casos de éxito"
    ],
    "contents": "\nEn el contexto académico, el Programa Primeros Pasos en RSE promueve la responsabilidad social en la acción gerencial y empresarial. En este programa, estudiantes, profesores y empresarios interactúan para realizar una intervención y acompañamiento en la propia empresa, comprometiéndose con la implementación de criterios de gestión en el corto plazo.\nSe trata de un ejercicio de acercamiento Universidad-Empresa registrado por la Facultad de Administración de Empresas de la Universidad Externado de Colombia. En este programa, los estudiantes actúan como consultores junior realizando una intervención y acompañamiento al empresario al interior de su propia organización. Los profesores, por su parte, cumplen el rol de consultores senior apoyando en el proceso a los estudiantes y asesorando a los empresarios según su especialidad. Los empresarios actúan como agentes de cambio en la empresa comprometiéndose con la implementación de criterios de gestión en el corto plazo apoyándose en sus respectivos asesores (estudiantes y profesores).\n3sc4l4A pesar del avance teórico y robusto del programa, no contaban con herramientas de recolección, almacenamiento, análisis y presentación de la información que permitieran optimizar los procesos. Estaban trabajando con una plantilla de MS Excel que, aunque tenía fórmulas, su mantenimiento suponía un enorme esfuerzo.\nDespués de una toma de requerimientos y un análisis inicial, diseñamos y desarrollamos la solución que nuestros clientes necesitaban. Usando metodologías ágiles, creamos 3sc4l4, un aplicativo que permite la administración de usuarios y la captura de información de las empresas y sus stakeholders por parte de estudiantes.\nAl interior del aplicativoPero 3sc4l4 no solo captura la información, sino que también la analiza. Luego de una recolección de datos preliminar, genera un primer conjunto de analíticas que permiten identificar las oportunidades de mejora de la empresa. Con estas oportunidades identificadas, los estudiantes pueden generar planes de acción con indicadores claros de tiempos, esfuerzo y resultado necesarios para cada uno. Todo este análisis se condensa en un informe final que es presentado a los directivos de las organizaciones participantes.\n¡Si tienes una empresa y quieres iniciar en la responsabilidad social empresarial, inscríbete en el programa Primeros Pasos de la Facultad de Administración de Empresas de la Universidad Externado de Colombia! Y si tienes un problema de datos, ¡contacta a nuestro equipo para crear una solución a la medida que se ajuste a tus expectativas! Juntos podemos transformar tus procesos y mejorar la toma de decisiones. ¡Te esperamos!\n\n\n\n",
    "preview": "posts/2023-04-10-transformando-la-responsabilidad-social-empresarial-por-medio-de-ciencia-de-datos/3sc4l4-logo.png",
    "last_modified": "2023-04-10T19:04:10-05:00",
    "input_file": "transformando-la-responsabilidad-social-empresarial-por-medio-de-ciencia-de-datos.knit.md",
    "preview_width": 1095,
    "preview_height": 981
  },
  {
    "path": "posts/2023-04-03-mejorar-la-cadena-de-informacin-para-mejorar-la-cadena-de-suministro/",
    "title": "Mejorar la cadena de información para mejorar la cadena de suministro",
    "description": "Las empresas pueden mejorar la eficiencia, la atención al cliente y reducir costos al mejorar el flujo de información desde el cliente hasta el proveedor mediante el uso de tecnología, colaboración, análisis de datos y capacitación. Las iniciativas clave para lograr el éxito son tres: reemplazar las previsiones de consenso con una visión unificada de la demanda, alejarse de una estrategia de cadena de suministro única para una estrategia segmentada y crear un plan único para equilibrar continuamente la oferta y la demanda e identificar y responder a desviaciones o interrupciones.",
    "author": [
      {
        "name": "Deep Thinking",
        "url": "https://deepthinking.com.co/"
      }
    ],
    "date": "2023-04-03",
    "categories": [
      "Cadena de suministro",
      "Inteligencia de negocios",
      "Cadena de información"
    ],
    "contents": "\nLa gestión de la cadena de suministro es clave en la economía global, coordinando y optimizando el flujo de bienes y servicios desde las materias primas hasta el producto final. Uno de los aspectos más importantes de la gestión de la cadena de suministro es la gestión de la información, que incluye los datos de la demanda, inventario, producción y transporte entre los diferentes actores involucrados en la cadena: proveedores, fabricantes, distribuidores, minoristas y clientes.\nLa mejora de la gestión de la información en la cadena de suministro es esencial para optimizar la gestión de la cadena, y para ello se requiere un enfoque multi-puntual que incluye:\nUso de tecnología: la implementación de soluciones de software para la automatización de la recopilación y el análisis de datos, así como de plataformas digitales para compartir información en tiempo real con proveedores y clientes.\nColaboración: la colaboración entre los actores de la cadena es esencial para establecer formatos de datos comunes, métricas y estándares de informes.\nAnálisis de datos: la aplicación de análisis de datos puede ayudar a identificar patrones y tendencias, permitiendo a las empresas tomar decisiones informadas, por ejemplo, ajustando la producción y los niveles de inventario en función de las tendencias de la demanda.\nCapacitación: se deben proporcionar programas de capacitación para que los empleados adquieran las habilidades necesarias para recopilar, analizar y compartir información de manera efectiva.\nFoto de Tom Fisk, vía PexelsLa mejora de la gestión de la información en la cadena de suministro tiene varios beneficios, como una mayor eficiencia, una mejor atención al cliente y una reducción de costos.\nAdemás, se ha demostrado que las empresas pueden lograr beneficios sustanciales mediante la digitalización de su cadena de suministro, incluso con un enfoque más moderado y menos costoso que la transformación masiva de la cadena de suministro, que requiere grandes inversiones en tecnología en la nube, la instalación de etiquetas RFID y lectores en cada contenedor y en cada instalación, la implementación de tecnologías de impresión en 3D y robótica, y la incorporación de nuevos instrumentos en las máquinas en el piso de producción para monitorear su rendimiento y condición.\nLa clave del éxito de este enfoque radica en tres iniciativas:\nReemplazo de las previsiones de consenso con una visión unificada de la demanda.\nAlejamiento de una estrategia de cadena de suministro única para una estrategia segmentada.\nCreación de un plan único para equilibrar continuamente la oferta y la demanda e identificar y responder a desviaciones o interrupciones.\nLa implementación de estas iniciativas puede permitir a las empresas reducir costos, mejorar la capacidad de respuesta, aumentar la eficiencia y la satisfacción del cliente.\nEn conclusión, mejorar la gestión de la cadena de suministro mediante la mejora de la cadena de información puede llevar a una mayor eficiencia, mejor servicio al cliente y reducción de costos. Se sugiere que las empresas deben enfocarse en mejorar el flujo de información desde el cliente hasta el proveedor mediante el uso de tecnología, colaboración, análisis de datos y capacitación. Además, se sugiere que la modernización de la cadena de suministro no siempre requiere una gran inversión y puede lograrse a través de iniciativas más moderadas que incluyan la mejora de la planificación de la demanda, la segmentación de la estrategia de la cadena de suministro y la creación de un plan para equilibrar continuamente la oferta y la demanda.\nEste artículo se basa en este otro: A Simpler Way to Modernize Your Supply Chain\n\n\n\n",
    "preview": "posts/2023-04-03-mejorar-la-cadena-de-informacin-para-mejorar-la-cadena-de-suministro/supply.jpg",
    "last_modified": "2023-04-03T08:43:52-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2023-03-31-estas-son-las-principales-tendencias-en-inteligencia-de-negocios/",
    "title": "Estas son las principales tendencias en inteligencia de negocios",
    "description": "La inteligencia de negocios se ha convertido en un campo clave en la gestión empresarial, y cada vez más organizaciones están aprovechando la información generada para mejorar su rendimiento y obtener una ventaja competitiva. Estas son las cuatro principales tendencias en inteligencia de negocios que están transformando la forma en que las empresas gestionan sus datos.",
    "author": [
      {
        "name": "Deep Thinking",
        "url": "https://deepthinking.com.co/"
      }
    ],
    "date": "2023-03-31",
    "categories": [
      "Inteligencia de negocios"
    ],
    "contents": "\nEn la actualidad, los avances tecnológicos están revolucionando todas las industrias y cambiando la forma en que las empresas toman decisiones. La inteligencia de negocios se ha convertido en un campo clave en la gestión empresarial, permitiendo a las organizaciones aprovechar al máximo la información que generan.\nA continuación, se presentan las cuatro principales tendencias en inteligencia de negocios:\nFoto de Pramod Tiwari, vía PexelsIntegración de los procesos de datos\nLa integración de procesos de datos es uno de los principales aspectos en la inteligencia de negocios, ya que ayuda a las empresas a manejar grandes cantidades de información de manera eficiente. Anteriormente, las empresas manejaban sus datos mediante cadenas de información que involucraban múltiples proveedores de datos. Este enfoque a menudo resultaba en datos desactualizados, incompletos y en una sobrecarga de trabajo para los equipos encargados de gestionarlos.\nCon la integración de procesos de datos, la gestión de los datos es más efectiva y eficiente. Los datos son capturados y almacenados en un lugar centralizado, lo que garantiza que los datos sean precisos, actualizados y estén disponibles en tiempo real. Esto significa que las empresas pueden tomar decisiones informadas de manera más rápida y precisa.\nAdemás, la integración de procesos de datos elimina la necesidad de múltiples proveedores de datos. En lugar de tener que lidiar con diferentes proveedores y formatos de datos, las empresas pueden tener un solo proveedor que maneje todo el proceso, lo que reduce los costos y ahorra tiempo. La integración también facilita la integración de nuevos sistemas y aplicaciones en la empresa, lo que permite que la empresa tenga una visión completa de todos sus datos.\nInteligencia artificial y algorítmica\nLa inteligencia artificial y los algoritmos son tecnologías que han experimentado un enorme crecimiento en los últimos años y que están transformando la forma en que las empresas gestionan sus datos. La automatización de procesos que antes necesitaban intervención humana está creando ventajas competitivas duraderas en la industria. El uso de algoritmos e inteligencia artificial ayuda a disminuir los costos y facilita procesos de maneras impresionantes.\nEl análisis predictivo y la identificación de patrones complejos en grandes conjuntos de datos son dos áreas donde la inteligencia artificial y los algoritmos están teniendo un impacto significativo en la inteligencia de negocios. Estas tecnologías pueden analizar grandes cantidades de datos en tiempo real y proporcionar información valiosa a los gerentes y tomadores de decisiones.\nEl análisis predictivo utiliza modelos matemáticos y estadísticos para identificar patrones en los datos y hacer predicciones sobre eventos futuros. Por ejemplo, puede ser utilizado para predecir la demanda futura de un producto o servicio, lo que puede ayudar a las empresas a tomar decisiones informadas sobre la producción y el inventario.\nLa identificación de patrones complejos en grandes conjuntos de datos también es una aplicación importante de la inteligencia artificial y los algoritmos. Estos patrones pueden no ser evidentes para los seres humanos, pero pueden proporcionar información valiosa sobre las tendencias del mercado, las preferencias de los clientes y los comportamientos de los usuarios. Esta información puede ayudar a las empresas a tomar decisiones informadas sobre la comercialización, el diseño de productos y la segmentación de clientes.\nCultura de datos\nLa cultura de datos es un enfoque cada vez más importante en las empresas y se refiere a la necesidad de tomar decisiones basadas en datos en lugar de intuiciones o conjeturas. Esto significa que las empresas necesitan desarrollar una cultura en la que los datos sean valorados y utilizados como una herramienta clave para la toma de decisiones.\nLa conformación de equipos especializados en análisis de datos y la capacitación de los empleados en habilidades de análisis de datos son esenciales para fomentar una cultura de datos. Además, las empresas deben invertir en tecnología que les permita recopilar, almacenar y analizar datos de manera efectiva.\nEsta cultura de datos también implica el uso de métricas clave para medir el rendimiento de la empresa y tomar decisiones informadas. Esto puede incluir el seguimiento del tráfico del sitio web, las ventas, los gastos y otros factores relevantes para el éxito de la empresa.\nEs importante destacar que la cultura de datos no solo se aplica a las grandes empresas, sino también a las pequeñas y medianas empresas (PYMES). A medida que las herramientas de análisis de datos se vuelven más accesibles y asequibles, las PYMES también pueden beneficiarse de una cultura de datos para mejorar su rendimiento y tomar decisiones más informadas.\nIdentificación de oportunidades\nLa identificación de oportunidades basadas en datos es un proceso clave en la inteligencia de negocios. El uso de la tecnología y los análisis de datos pueden ayudar a las empresas a encontrar patrones, tendencias y oportunidades que no son evidentes a simple vista. Los directivos y líderes empresariales que tienen habilidades gerenciales en tecnología están mejor capacitados para entender la importancia de los datos y cómo pueden ayudar a impulsar el crecimiento empresarial.\nPara poder identificar oportunidades de mejora basadas en datos, es necesario que las empresas tengan acceso a datos precisos y actualizados. Además, deben contar con personal capacitado para analizar y entender la información. La identificación de oportunidades basadas en datos también requiere que las empresas tengan una cultura organizacional orientada hacia el uso de los datos.\nCuando se identifican oportunidades de mejora basadas en datos, las empresas pueden implementar nuevos procesos y estrategias para aprovechar esas oportunidades. Esto puede mejorar la eficiencia, reducir los costos y aumentar la rentabilidad de la empresa. Por ejemplo, una empresa puede identificar patrones en las compras de sus clientes y utilizar esa información para ofrecer promociones personalizadas a los clientes más fieles.\nConclusión\nLa inteligencia de negocios es un campo en constante evolución que se adapta a los cambios tecnológicos. Las tendencias presentadas en este post reflejan la necesidad de las empresas de integrar sus procesos de datos, utilizar la inteligencia artificial y algorítmica, fomentar una cultura organizacional orientada hacia el uso de los datos y aprovechar las oportunidades de mejora basadas en datos. Con estas tendencias, las empresas pueden obtener una ventaja competitiva y tomar decisiones más informadas y efectivas.\n\n\n\n",
    "preview": "posts/2023-03-31-estas-son-las-principales-tendencias-en-inteligencia-de-negocios/trend.jpg",
    "last_modified": "2023-03-28T15:48:20-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2023-03-30-el-desastre-del-challenger-cuando-las-fallas-de-informacin-cuestan-vidas-humanas/",
    "title": "El desastre del Challenger: Cuando las fallas de información cuestan vidas humanas",
    "description": "El desastre del Challenger, ocurrido el 28 de enero de 1986, fue una lección trágica sobre la importancia del análisis de datos en la toma de decisiones críticas. El incidente fue causado por la destrucción de los sellos que se utilizan para evitar fugas de gases calientes en la sección del motor sólido del transbordador espacial. Los investigadores descubrieron que el problema fue causado por una predicción inadecuada del comportamiento de los sellos a temperaturas más frías durante la misión 51-L del Challenger.",
    "author": [
      {
        "name": "Deep Thinking",
        "url": "https://deepthinking.com.co/"
      }
    ],
    "date": "2023-03-30",
    "categories": [
      "Cadena de información",
      "Historia"
    ],
    "contents": "\nEl desastre del Challenger, ocurrido el 28 de enero de 1986, fue causado por la destrucción de los sellos que impiden que los gases calientes escapen de los cohetes. La atención se centró rápidamente en los anillos de goma que se utilizan para sellar la unión entre dos secciones del motor del cohete: el “tang” y el “clevis”. Los anillos de goma deben ser lo suficientemente flexibles para comprimirse y expandirse en milisegundos, y su resiliencia está directamente relacionada con la temperatura. Los investigadores descubrieron que un anillo de goma comprimido es cinco veces más sensible a 75 grados Fahrenheit que a 30 grados Fahrenheit. Sin embargo, la temperatura en el momento del lanzamiento del Challenger era de solo 36 grados Fahrenheit, lo que probablemente impidió que los anillos de goma se comprimieran y expandieran adecuadamente, permitiendo que los gases escaparan y destruyeran el cohete.\nPero, ¿por qué los ingenieros no detuvieron el lanzamiento dado el clima frío? Intentaron hacerlo, pero no tenían suficientes datos. No sabían qué sucedería con los anillos de goma en un día donde la temperatura era 15 grados más fría que en cualquier otro lanzamiento anterior. Un análisis rápido de los datos de lanzamientos anteriores permitiría una decisión certera. No obstante, solo consideraron los casos donde hubo signos de problemas con los anillos de goma, lo que limitó los datos a solo siete de los 24 lanzamientos hasta ese momento.\nLanzamiento del ChallengerEn retrospectiva, los ingenieros deberían haber analizado todos los datos sobre el rendimiento de los anillos de goma, no solo los casos con problemas. Cuando se analizan todos los datos, incluidos los vuelos sin incidentes, se puede ver claramente que la temperatura afectó el rendimiento de los anillos de goma. Por encima de los 65 grados, solo 3 de los 20 vuelos tuvieron incidentes, mientras que por debajo de los 65 grados, los 4 vuelos tuvieron incidentes.\nEste error de análisis de datos es un ejemplo clásico de cómo la falta de rigor en el tratamiento de la información, incluso con las mejores intenciones, puede contribuir a resultados desastrosos. La lección aprendida aquí es que se deben considerar todos los datos disponibles al responder preguntas específicas, y no solo una selección parcial de los mismos.\nEn conclusión, el desastre del Challenger nos recuerda la importancia de analizar cuidadosamente los datos y de no tomar decisiones basadas en una muestra parcial de los mismos. Es crucial considerar todos los datos disponibles al responder preguntas específicas para evitar consecuencias catastróficas.\nFuente: The Challenger disaster: A tragic lesson in data analysis\nModelo predictivo: Challenger O-Ring Data – Logistic Regression\n\n\n\n",
    "preview": "posts/2023-03-30-el-desastre-del-challenger-cuando-las-fallas-de-informacin-cuestan-vidas-humanas/challenger.jpg",
    "last_modified": "2023-04-10T16:58:53-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2023-03-29-cmo-personaliza-netflix-tu-bandeja-de-entrada-usando-procesos-de-datos/",
    "title": "¿Cómo personaliza Netflix tu bandeja de entrada usando procesos de datos?",
    "description": "Netflix está personalizando la experiencia de sus usuarios, y para ello utiliza imágenes, trailers y sinopsis de títulos que son más relevantes y atractivos para cada usuario. Para crear suites de arte relevantes, atractivas y auténticas, Netflix combina el conocimiento de expertos en estrategia y diseño con herramientas de análisis de datos para identificar las tendencias.",
    "author": [
      {
        "name": "Deep Thinking",
        "url": "https://deepthinking.com.co/"
      }
    ],
    "date": "2023-03-29",
    "categories": [
      "Inteligencia artificial",
      "Inteligencia de negocios"
    ],
    "contents": "\nNetflix utiliza un algoritmo de personalización de imágenes para mostrar a sus usuarios las portadas, trailers y sinopsis más relevantes de las películas y series disponibles. En un artículo reciente publicado en su blog, la compañía explica cómo se crean estas imágenes y por qué son importantes para la experiencia del usuario.\nLa publicidad es fundamental para que los usuarios descubran nuevos títulos en la plataforma, pero no quieren que la publicidad sea engañosa. Por lo tanto, se requiere un enfoque cuidadoso para asegurarse de que las imágenes de promoción sean atractivas y relevantes para el usuario, al mismo tiempo que reflejen auténticamente el contenido del título.\nDistintas portadas para una misma producción.Para desarrollar las mejores imágenes, Netflix trabaja con estrategas y diseñadores creativos que tienen un conocimiento íntimo de los títulos que se promocionan, junto con una serie de herramientas que ayudan a identificar las tendencias en el rendimiento de la publicidad anterior. A través de un enfoque de colaboración entre el equipo de creadores y el equipo de análisis de datos, se puede lograr una combinación de arte y ciencia que permita desarrollar la mejor publicidad.\nPara crear las imágenes, Netflix utiliza dos enfoques diferentes: el enfoque de arriba hacia abajo, en el que se identifican de antemano las propiedades de la imagen que se investigarán en función de las creencias iniciales, y el enfoque de abajo hacia arriba, en el que se permite que los datos revelen tendencias importantes de manera natural.\nEn el enfoque de arriba hacia abajo, Netflix utiliza una descripción detallada de la imagen utilizando atributos y características que se han identificado como importantes en el pasado. Se utilizan técnicas de aprendizaje automático para modelar estas características, que van desde características básicas como el color y la textura hasta características más complejas como la composición y las expresiones faciales. Este enfoque proporciona una comprensión detallada de lo que hace que una imagen sea efectiva y ayuda a los creadores a desarrollar imágenes que sean visualmente atractivas y relevantes para el usuario.\nEn el enfoque de abajo hacia arriba, Netflix permite que los datos identifiquen tendencias y patrones importantes en el rendimiento de la publicidad anterior. Se agrupan imágenes similares y se analizan en conjunto para identificar patrones importantes. Este enfoque es útil para identificar tendencias que no se habían considerado previamente y para descubrir nuevas formas de crear imágenes que sean atractivas y efectivas.\nEn general, la creación de imágenes de promoción es un proceso complejo que requiere una combinación de experiencia en el diseño y análisis de datos. Al utilizar enfoques de arriba hacia abajo y de abajo hacia arriba, Netflix puede desarrollar imágenes de alta calidad que sean relevantes y auténticas, al mismo tiempo que se ajustan a las necesidades de los usuarios.\nFuente: Discovering Creative Insights in Promotional Artwork\n\n\n\n",
    "preview": "posts/2023-03-29-cmo-personaliza-netflix-tu-bandeja-de-entrada-usando-procesos-de-datos/netflix.png",
    "last_modified": "2023-03-28T15:45:18-05:00",
    "input_file": {},
    "preview_width": 666,
    "preview_height": 312
  },
  {
    "path": "posts/2023-03-28-chat-gpt-ahora-con-superpoderes/",
    "title": "Chat-GPT: Ahora con superpoderes",
    "description": "Se ha anunciado la incorporación de plugins a GPT, lo que le permite tener acceso a una gran variedad de servicios externos. Esto permite que los modelos de lenguaje, como GPT, superen las limitaciones de los datos de entrenamiento utilizados. Ahora, GPT tendrá acceso a servicios fiscales, reservas de vuelos, creación de automatizaciones y mucho más.",
    "author": [
      {
        "name": "Deep Thinking",
        "url": "https://deepthinking.com.co/"
      }
    ],
    "date": "2023-03-28",
    "categories": [
      "Inteligencia artificial"
    ],
    "contents": "\nOpenAI ha anunciado nuevos plugins que permiten a su modelo de lenguaje GPT adquirir una serie de superpoderes, lo que le permite hacer tareas que antes no podía hacer, como reservar vuelos, comprar productos, editar imágenes y videos, explorar internet, programar y ejecutar código, entre otros. Estos plugins están diseñados para conectarse a diferentes servicios externos y proporcionar a GPT acceso a una cantidad infinita de datos en tiempo real. Además, los desarrolladores pueden crear sus propios plugins para agregar nuevas habilidades al modelo de lenguaje.\nOpenAI destaca que los plugins permiten que GPT supere las limitaciones que tenía antes, ya que estaba limitado por los datos de entrenamiento que se utilizaron para su desarrollo. Ahora, gracias a los plugins, el modelo de lenguaje puede acceder a una gran cantidad de información actualizada y servicios externos en tiempo real.\nFoto de Pavel Danilyuk, vía PexelsEntre las nuevas habilidades, se encuentran la capacidad de explorar la web para buscar información actualizada, procesar imágenes y videos, realizar análisis de datos y ejecutar código. También se mencionan algunos plugins disponibles actualmente, como Kayak para reservar vuelos, Instacart para hacer compras y Sapir para automatizar procesos.\nAdicionalmente, se tienen actualización con respecto a la seguridad de los plugins y cómo se están abordando las preocupaciones sobre la posibilidad de un mal uso de esta tecnología. Además, se señala que en un futuro próximo, los desarrolladores pueden crear sus propios plugins y se proporciona información sobre cómo hacerlo.\nEn resumen, el modelo GPT, en su próxima entrega, tendrá superpoderes, a través de plugins que le permiten realizar una amplia gama de tareas, abriendo nuevas posibilidades para el modelo de lenguaje y superando las limitaciones que tenía anteriormente. También se aborda la seguridad de los plugins y se proporciona información para los desarrolladores interesados en crear sus propios plugins.\nFuente: ChatGPT ahora tiene superpoderes\n\n\n\n",
    "preview": "posts/2023-03-28-chat-gpt-ahora-con-superpoderes/gpt.jpg",
    "last_modified": "2023-04-10T15:48:42-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2023-03-25-hasta-el-31-de-marzo-podrs-estudiar-inteligencia-artificial-gratis-en-platzi/",
    "title": "Hasta el 31 de marzo, podrás estudiar inteligencia artificial gratis en Platzi",
    "description": "La plataforma de formación en línea Platzi ha lanzado un curso gratuito de introducción a la inteligencia artificial, que estará disponible para su acceso hasta el 31 de marzo. El curso se enfoca en herramientas representativas de IA, como el chatbot y el generador de imágenes de OpenAI, así como la plataforma de alojamiento y ejecución de modelos de IA Hugging Face. Además, el curso incluye conceptos clave en la IA, como 'data science', 'machine learning', 'deep learning' y 'procesamiento de lenguaje natural', y también se aborda el papel que tienen las matemáticas y la ética en el uso de datos para la IA.",
    "author": [
      {
        "name": "Deep Thinking",
        "url": "https://deepthinking.com.co/"
      }
    ],
    "date": "2023-03-27",
    "categories": [],
    "contents": "\nLa plataforma de formación en línea Platzi acaba de lanzar un curso gratuito de introducción a la inteligencia artificial, disponible hasta finales de marzo. Esta iniciativa resulta especialmente relevante en un momento en que la IA está en pleno auge, con herramientas como ChatGPT y plataformas para la generación de imágenes. Para muchos usuarios, mantenerse al día en este ámbito puede resultar un desafío, ya que el ritmo de lanzamiento de nuevas plataformas y funciones es frenético.\nA pesar de que hay muchos cursos disponibles sobre IA, no siempre son de calidad y, además, suelen ser muy costosos. Por eso, el lanzamiento de este curso por parte de una plataforma reconocida como Platzi es una excelente noticia. El temario no pretende abarcar todo el catálogo de herramientas de IA que han surgido en los últimos meses, sino que se centra en algunas de las más relevantes, como el chatbot y el generador de imágenes de OpenAI, y la plataforma de alojamiento y ejecución de modelos de IA Hugging Face.\nFoto de cottonbro studio, vía PexelsEl curso también introduce al estudiante en conceptos clave como data science, machine learning, deep learning y procesamiento de lenguaje natural, y aborda la ética en el uso de datos. En total, el curso consta de 3 horas de contenidos en vídeo y 14 horas destinadas a la práctica, además de acceso a proyectos y tutoriales creados y publicados por otros estudiantes. Para registrarse en la plataforma y acceder al curso, solo es necesario proporcionar nombre y correo electrónico.\nEn resumen, el curso gratuito de introducción a la IA de Platzi es una oportunidad excelente para aprender sobre este tema tan importante y en constante evolución. Además, la plataforma es reconocida por su calidad y su enfoque práctico, por lo que se trata de una opción muy recomendable para cualquier persona interesada en este campo.\nLink al curso: Curso Gratis de Inteligencia Artificial: ChatGPT, DALL-E y Hugging Face\n\n\n\n",
    "preview": "posts/2023-03-25-hasta-el-31-de-marzo-podrs-estudiar-inteligencia-artificial-gratis-en-platzi/ia.jpg",
    "last_modified": "2023-03-27T15:51:58-05:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Bienvenidos a Deep Thinking",
    "description": "Este es nuestro blog. Estaremos generando contenido desde aqui.",
    "author": [
      {
        "name": "Deep Thinking",
        "url": "https://deepthinking.com.co/"
      }
    ],
    "date": "2023-03-25",
    "categories": [],
    "contents": "\n\n\n\n\n",
    "preview": "posts/welcome/logo.jpg",
    "last_modified": "2023-03-25T14:32:14-05:00",
    "input_file": {}
  }
]
