[
  {
    "path": "posts/2023-03-25-chat-gpt-ahora-con-superpoderes/",
    "title": "Chat-GPT: Ahora con superpoderes",
    "description": "Se ha anunciado la incorporación de plugins a GPT, lo que le permite tener acceso a una gran variedad de servicios externos. Esto permite que los modelos de lenguaje, como GPT, superen las limitaciones de los datos de entrenamiento utilizados. Ahora, GPT tendrá acceso a servicios fiscales, reservas de vuelos, creación de automatizaciones y mucho más.",
    "author": [
      {
        "name": "Deep Thinking",
        "url": "https://deepthinking.com.co/"
      }
    ],
    "date": "2023-03-25",
    "categories": [],
    "contents": "\nOpenAI ha anunciado nuevos plugins que permiten a su modelo de lenguaje GPT adquirir una serie de superpoderes, lo que le permite hacer tareas que antes no podía hacer, como reservar vuelos, comprar productos, editar imágenes y videos, explorar internet, programar y ejecutar código, entre otros. Estos plugins están diseñados para conectarse a diferentes servicios externos y proporcionar a GPT acceso a una cantidad infinita de datos en tiempo real. Además, los desarrolladores pueden crear sus propios plugins para agregar nuevas habilidades al modelo de lenguaje.\nOpenAI destaca que los plugins permiten que GPT supere las limitaciones que tenía antes, ya que estaba limitado por los datos de entrenamiento que se utilizaron para su desarrollo. Ahora, gracias a los plugins, el modelo de lenguaje puede acceder a una gran cantidad de información actualizada y servicios externos en tiempo real.\nFoto de Pavel Danilyuk, vía PexelsEntre las nuevas habilidades, se encuentran la capacidad de explorar la web para buscar información actualizada, procesar imágenes y videos, realizar análisis de datos y ejecutar código. También se mencionan algunos plugins disponibles actualmente, como Kayak para reservar vuelos, Instacart para hacer compras y Sapir para automatizar procesos.\nAdicionalmente, se tienen actualización con respecto a la seguridad de los plugins y cómo se están abordando las preocupaciones sobre la posibilidad de un mal uso de esta tecnología. Además, se señala que en un futuro próximo, los desarrolladores pueden crear sus propios plugins y se proporciona información sobre cómo hacerlo.\nEn resumen, el modelo GPT, en su próxima entrega, tendrá superpoderes, a través de plugins que le permiten realizar una amplia gama de tareas, abriendo nuevas posibilidades para el modelo de lenguaje y superando las limitaciones que tenía anteriormente. También se aborda la seguridad de los plugins y se proporciona información para los desarrolladores interesados en crear sus propios plugins.\nFuente: ChatGPT ahora tiene superpoderes\n\n\n\n",
    "preview": "posts/2023-03-25-chat-gpt-ahora-con-superpoderes/gpt.jpg",
    "last_modified": "2023-03-25T14:29:32-05:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Bienvenidos a Deep Thinking",
    "description": "Este es nuestro blog. Estaremos generando contenido desde aqui.",
    "author": [
      {
        "name": "Deep Thinking",
        "url": "https://deepthinking.com.co/"
      }
    ],
    "date": "2023-03-25",
    "categories": [],
    "contents": "\n\n\n\n\n",
    "preview": "posts/welcome/logo.jpg",
    "last_modified": "2023-03-25T14:32:14-05:00",
    "input_file": {}
  }
]
